tutorials/RAS/suspensionDev/0_org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            groovyBC;
        refValue        uniform (0.6 0 0);
        valueExpression "vector(inletprofileu(pos().z),0,0)";
        gradientExpression "vector(0,0,0)";
        fractionExpression "1";
        evaluateDuringConstruction 1;
        cyclicSlave      0;
        variables        "toto=10;";
        timelines       ();
        lookuptables    (
        {
        name            inletprofileu;
        file            "$FOAM_CASE/1Dflow/U.xy";
        outOfBounds     clamp;
        }
        );

    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    top
    {
        type            slip;
    }

    bed
    {
        type            noSlip;
    }

    sides
    {
        type            empty;
    }
}


// ************************************************************************* //
