tutorials/RAS/suspensionDev/0_org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    inlet
    {
        type                   groovyBC;
        refvalue               uniform 0.033;
        value                  uniform 0.033;
        refGradient            uniform 0;
        valueFraction          uniform 1;
        valueExpression        "inletprofilek(pos().z)";
        gradientExpression     "0";
        fractionExpression     "1";
        evaluateDuringConstruction 1;
        cyclicSlave            0;
        variables              "toto=10;";
        timelines              ();
        lookuptables
            (
                {
                    name            inletprofilek;
                    file            "$FOAM_CASE/1Dflow/k.xy";
                    outOfBounds     clamp;
                }
            );
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    top
    {
        type            kqRWallFunction;
	value           $internalField;
    }

    bed
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    sides
    {
        type            empty;
    }
}


// ************************************************************************* //
