tutorials/RAS/suspensionDev/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

H     0.1;  // water depth
Lx    #eval{ 150 * $H };  // channel length
dy    0.01;  // domain width in empty direction

nx    2000;  // cell number in x-direction
nz    100;  // cell number in z-direction
gx    2;  // grading value in x-direction
gz    ((1 2 30)(1 1 0.3));  // grading value in z-direction


vertices
(
    (0 0 0) // 0
    ($Lx 0 0) // 1
    ($Lx $dy 0) // 2
    (0 $dy 0) // 3
    (0 0 $H) // 4
    ($Lx 0 $H) // 5
    ($Lx $dy $H) // 6
    (0 $dy $H) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx 1 $nz) simpleGrading ($gz 1 $gz)
);

edges
(
);

boundary
(
    inlet
    {
        type   patch;
        faces
            (
                (0 4 7 3)
            );
    }
    outlet
    {
        type   patch;
        faces
            (
                (1 2 6 5)
            );
    }
    top
    {
        type   wall;
        faces
            (
                (4 5 6 7)
            );
    }
    bed
    {
        type   wall;
        faces
            (
                (3 2 1 0)
            );
    }
    sides
    {
        type   empty;
        faces
            (
                (0 1 5 4)
                (7 6 2 3)
            );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
